Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G70B.tmx
Source language: en_us
Languages: zh_cn

source: Life Advice From My 99-Year-Old Grandpa -- Still the Coolest Guy I Know
zh_cn: 我所知道的最酷的家伙——祖父，给的人生建议

source: The words "cool" and "grandpa" don't always go together, but I've been hearing them used to describe my grandfather, Harrison "Steve" Stephens, all my life.
zh_cn: 词语“酷”和“祖父”通常不联系在一起，但是在我的一生中，我听到过用这些词形容我的祖父，哈里森·史蒂夫。

source: He and Grandma have the coolest love story.
zh_cn: 他和我的祖母拥有最酷的爱情故事。

source: In 1939, he was a cub reporter assigned to interview an unusual woman named Doris Landram -- the only female airplane pilot in Merced, California.
zh_cn: 在1939年，他还是一个新手记者，并被指派去采访一个叫桃丽丝·蓝郡的不平凡的女子——美国加州莫德赛唯一的女性飞行员。

source: Six weeks later, they were married!
zh_cn: 六个星期后，他俩结婚了!

source: When I was growing up, Grandpa was a newspaper editor by day, jazz guitarist by night.
zh_cn: 我慢慢长大的岁月里，白天祖父是新闻编辑，晚上是爵士乐吉他手。

source: He was a WWII Navy veteran (and lifelong sailor) who always kept his hair buzzed after his service because the military haircut was just so easy (apparently he roared with laughter when, as a little kid, I described him as having "prickly hair and a ruined face").
zh_cn: 他曾是二战的海军退役军人（终生的水手)下班后，他的头发总是乱乱的，因为军事发型就是如此简单。（显然那时他总是大笑，作为一个小孩，我把他形容为“愤怒的头发，魔鬼的脸”。

source: My grandparents were married nearly 70 years, until Grandma died in 2009.
zh_cn: 我的祖父母已经结婚将近70年，直到2009年祖母去世。

source: Together they raised four kids in a house that by all accounts was full of laughter and music.
zh_cn: 即尽所有原因相聚在一起的，他们的四个孩子，总是充满音乐和欢笑。

source: Their mutual love and deep friendship was a fantastic model for our family.
zh_cn: 他们彼此的爱和深厚的友情是我们家族的好榜样。

source: Though he has told me many times that he misses G'ma every day, G'pa continues to live a full life.
zh_cn: 尽管他告诉我他每天都思念着祖母，他仍然继续热爱着生活。

source: He hosts a jam session at his apartment each Tuesday with some of his musician pals.
zh_cn: 每个星期二他会在他的公寓里和他的音乐伙伴举办爵士乐演奏会。

source: "It starts as Steve's salon and then after martinis it turns into Steve's saloon," as he says.
zh_cn: 正如他所说“一开始它只是史蒂夫的小奏，然而几杯小酒后，它就变成了史蒂夫的大奏了。”

source: He writes a column for the Balboa Yacht Club newsletter ("A Dash of Salt"), mentored two foreign exchange students studying at Claremont Graduate University, and was the class of '38 correspondent for Stanford University's alumni magazine.
zh_cn: 他为巴尔博亚游艇俱乐部通讯做了一个专栏("少量的盐")顾问两个在克莱蒙研究所大学的两个外国交换生，也是是38级的记者对斯坦福大学的校友杂志。

source: He joked that he suspected they awarded him a Stanford Associates Award of Merit in 2008 "due to the mindset that thinks anybody over 85 who can complete a declarative sentence is a marvel," but accepted it with gratitude at a campus ceremony.
zh_cn: 他开玩笑说，他怀疑他们在2008年奖励他斯坦福大学协会奖是因为一种观念模式，认为可以完成一句肯定句的百分之八十五的人都是一个奇迹，”但是还是在校园仪式上感激的接受了。

source: A few years ago when Grandpa took a spill off his bicycle and broke his hip, my friends said things like, "Oh no! But that's so cool that he's in his 90s and still riding a bike!"
zh_cn: 几年前，他从他的自行车上脱落掉一个小塞子，然后摔坏了他的臀部。我的朋友是这样说的，“哦，不！但是在九十岁的年纪还骑自行车真是太酷了！”

source: In truly inspiring fashion, he bounced back and simply started riding a souped-up tricycle.
zh_cn: 在精神鼓舞的趋势下，他艰难的回归然后开始骑一个效率高的三轮车。
